Repository: manfred-mueller/KeepRunning
Catalog: Properties/Resources.*.resx
Languages: de

source: Choose file
de: Dateiauswahl

# ContextMenuRegister
source: Register context menu
de: Kontextmenü registrieren

# Daily
source: Once a day
de: einmal täglich

source: Executable Files|*.exe
de: Ausführbare Dateien|*.exe

source: Exit
de: Beenden

source: File not valid: {0}
de: Datei nicht gültig: {0}

# Hourly
source: Once an hour
de: einmal stündlich

source: Last Activity
de: Letzte Aktivität

# Monitoring0
source: Monitoring {0} {1}
de: Überwache {0} {1}

# NoValidExecutableExeFile
source: No valid executable file!
de: Keine gültige ausführbare Datei!

# ProcessIsNotRunningAndWillBeStarted
source: Program {0} is not running and will be started
de: Programm {0} läuft nicht und wird gestartet

# ProcessIsRunning
source: Program {0} is running
de: Programm {0} läuft

source: Process name
de: Prozessname

source: Ready
de: Fertig

# TwoTimesADay
source: twice a day
de: zweimal täglich

# DesktopLink
source: Create desktop link
de: Desktop-Link erstellen

# ProcessNameToCheck
source: Process name to check if executable is not found in process list
de: Zu prüfender Prozessname, falls ausführbare Datei nicht in Prozessliste erscheint

source: Choose check interval
de: Prüfungsintervall festlegen

source: start/stop monitoring
de: Monitoring starten/stoppen

# ClickToChoose
source: Click to choose the executable to monitor
de: Klicken, um die zu überwachende ausführbare Datei zu wählen

source: Another instance is already running!
de: Eine andere Programminstanz ist bereits aktiv!

source: Error
de: Fehler

# SettingsHaveChangedPleaseClickSaveButton
source: Settings changed. Please click 'Save' button!
de: Einstellungen geändert. Bitte 'Speichern'-Button anklicken!

source: Monitoring {0} stopped
de: Überwachung von {0} gestoppt

# SaveSettings
source: Save
de: Speichern

# Description
source: A small application to check periodically whether a program is running and to start that program if it is not running.<br> 1. Choose a program with a click on the button.<br> 2. If it is not in the systems processes list, type the processname in the field below.<br> 3. Adjust the time period to hourly, twice a day or daily.<br> 4. Save the settings with a click on the Save button.<br> 6. Start/Stop the monitoring with a click on the timer button in the middle of the screen.<br> You can create a desktop link and a context menu entry for the windows explorer via the taskbar icon menu.
de: Eine kleine Anwendung, um regelmäßig zu überprüfen, ob ein Programm ausgeführt wird, und um das Programm zu starten, wenn es nicht ausgeführt wird.<br> 1. Wählen Sie ein Programm mit einem Klick auf den Button aus.<br> 2. Wenn es nicht in der Liste der Systemprozesse enthalten ist, geben Sie den Prozessnamen in das Feld unten ein.<br> 3. Stellen Sie den Zeitraum auf stündlich, zweimal täglich oder täglich ein.<br> 4. Speichern Sie die Einstellungen mit einem Klick auf die Schaltfläche Speichern.<br> 6. Starten/stoppen Sie die Überwachung mit einem Klick auf die Timer-Schaltfläche in der Mitte des Bildschirms.<br> Über das Taskleistensymbol können Sie sowohl ein Desktopsymbol als auch einen Kontextmenü-Eintrag für den Windows Explorer erstellen.

# InfoAbout
source: Info about {0}
de: Info über {0}

# HelpLabel
source: About
de: Über
